// Напишите скрипт имитирующий авторизацию администратора в панели управления.

// Есть переменная message в которую будет записано сообщение о результате. При загрузке страницы у посетителя запрашивается логин через prompt:

// Если посетитель нажал Cancel — записать в message строку 'Отменено пользователем!'
// В протовном случае, если введенное значение не совпадает со значением константы ADMIN_LOGIN, записать в message строку 'Доступ запрещен, неверный логин!'
// В противном случае, то есть если ни одно из предыдущих условий не выполнилось, спрашивать пароль через prompt.
// При вводе пароля:

// Если нажали Cancel, записать в message строку 'Отменено пользователем!'
// В протовном случае, если введен пароль который не совпадает со значением константы ADMIN_PASSWORD, записать в message строку 'Доступ запрещен, неверный пароль!'
// В противном случае, то есть если ни одно из предыдущих условий не выполнилось, записать в message строку 'Добро пожаловать!'
// После всех проверок вывести в alert значение переменной message.

const ADMIN_LOGIN = 'admin';
const ADMIN_PASSWORD = 'm4ng0h4ckz';
let message;

const LOGIN = prompt('Введите login');

if(!LOGIN){
    message = 'Отменено пользователем!';
} else if(LOGIN !== ADMIN_LOGIN){
    message = 'Доступ запрещен, неверный логин!';
} else {
    const PASSWORD = prompt('Введите password');
    if(!PASSWORD){
        message = 'Отменено пользователем!';
    } else if(PASSWORD !== ADMIN_PASSWORD){
        message = 'Доступ запрещен, неверный пароль!';
    } else {
        message = 'Добро пожаловать!';
    }
}

alert(message);